#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/deploymenttheory/terraform-jamfpro-demo/runs/run-LeCairAvjsYbkJNc

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[0]: Refreshing state... [id=5044]
jamfpro_category.jamfpro_category_001: Refreshing state... [id=117]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[4]: Refreshing state... [id=5048]
jamfpro_script.jamfpro_script_001: Refreshing state... [id=7249]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[2]: Refreshing state... [id=5045]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[1]: Refreshing state... [id=5046]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[3]: Refreshing state... [id=5047]
jamfpro_macos_configuration_profile.jamfpro_macos_configuration_profile_001: Refreshing state... [id=1764]
jamfpro_package.jamfpro_package_002: Refreshing state... [id=109]
data.jamfpro_script.jamfpro_script_001_data: Refreshing...
data.jamfpro_script.jamfpro_script_001_data: Refresh complete after 1s [id=7249]
data.jamfpro_category.jamfpro_category_001_data: Refreshing...
data.jamfpro_category.jamfpro_category_001_data: Refresh complete after 0s [id=117]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[0]: Drift detected (update)
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[1]: Drift detected (update)
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[2]: Drift detected (update)
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[3]: Drift detected (update)
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[4]: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "JAMFPRO_CLIENT_SECRET"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-LeCairAvjsYbkJNc/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "JAMFPRO_INSTANCE_NAME"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-LeCairAvjsYbkJNc/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.jamfpro_package.jamfpro_package_001_data will be read during apply
  # (config refers to values not yet known)
 <= data "jamfpro_package" "jamfpro_package_001_data" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # jamfpro_package.jamfpro_package_001 will be created
  + resource "jamfpro_package" "jamfpro_package_001" {
      + allow_uninstalled             = false
      + boot_volume_required          = false
      + category                      = "Unknown"
      + filename                      = (known after apply)
      + fill_existing_users           = true
      + fill_user_template            = true
      + id                            = (known after apply)
      + info                          = "tf package deployment for demonstration"
      + install_if_reported_available = false
      + md5_file_hash                 = (known after apply)
      + name                          = "tf-ghatest-package-suspiciouspackage"
      + notes                         = "This package is used for Terraform provider documentation example."
      + os_requirements               = "macOS 10.15.1, macOS 10.15.7"
      + package_file_path             = "support_files/packages/SuspiciousPackage.dmg"
      + package_uri                   = (known after apply)
      + priority                      = 10
      + reboot_required               = false
      + send_notification             = true
    }

  # jamfpro_package.jamfpro_package_002 will be destroyed
  # (because jamfpro_package.jamfpro_package_002 is not in configuration)
  - resource "jamfpro_package" "jamfpro_package_002" {
      - allow_uninstalled             = false -> null
      - boot_volume_required          = false -> null
      - category                      = "Unknown" -> null
      - filename                      = "SuspiciousPackage.dmg" -> null
      - fill_existing_users           = true -> null
      - fill_user_template            = true -> null
      - id                            = "109" -> null
      - info                          = "tf package deployment for demonstration" -> null
      - install_if_reported_available = false -> null
      - name                          = "tf-ghatest-package-suspiciouspackage" -> null
      - notes                         = "This package is used for Terraform provider documentation example." -> null
      - os_requirements               = "macOS 10.15.1, macOS 10.15.7" -> null
      - package_file_path             = "support_files/packages/SuspiciousPackage.dmg" -> null
      - package_uri                   = "s3://us-east-1-prod-jcds2-file-objects/tmp/52ed21f3-38ce-4a86-9dd8-3ff132395b40/SuspiciousPackage.dmg" -> null
      - priority                      = 10 -> null
      - reboot_required               = false -> null
      - send_notification             = true -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + jamfpro_package_001_data_id    = (known after apply)
  + jamfpro_package_001_data_name  = (known after apply)
  - jamfpro_package_002_data_id    = "109" -> null
  - jamfpro_package_002_data_name  = "tf-ghatest-package-suspiciouspackage" -> null

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 9 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @ShocOne, Action: `pull_request`, Working Directory: `workload/terraform/jamfpro`, Workflow: `Terraform Plan`*